{
  "nodes": [
    {
      "op": "null", 
      "name": "timeFeaturesPred", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "dec_input_seq", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "12", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat58", 
      "attrs": {
        "axis": "0", 
        "repeats": "100"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "itemFeatures", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "item_features_categorical_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embed_0_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "item_embed_0", 
      "attrs": {
        "input_dim": "58", 
        "output_dim": "10"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embed_1_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "item_embed_1", 
      "attrs": {
        "input_dim": "25", 
        "output_dim": "10"
      }, 
      "inputs": [[4, 1, 0], [7, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "item_inputs_embed", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "trainTarget", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims6", 
      "attrs": {"axis": "2"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "trainTarget_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "49", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat54", 
      "attrs": {
        "dim": "1", 
        "num_args": "12"
      }, 
      "inputs": [
        [12, 37, 0], 
        [12, 38, 0], 
        [12, 39, 0], 
        [12, 40, 0], 
        [12, 41, 0], 
        [12, 42, 0], 
        [12, 43, 0], 
        [12, 44, 0], 
        [12, 45, 0], 
        [12, 46, 0], 
        [12, 47, 0], 
        [12, 48, 0]
      ]
    }, 
    {
      "op": "abs", 
      "name": "abs1", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "observedValuesTrain", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims9", 
      "attrs": {"axis": "2"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "observedValuesTrain_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "49", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat55", 
      "attrs": {
        "dim": "1", 
        "num_args": "12"
      }, 
      "inputs": [
        [17, 37, 0], 
        [17, 38, 0], 
        [17, 39, 0], 
        [17, 40, 0], 
        [17, 41, 0], 
        [17, 42, 0], 
        [17, 43, 0], 
        [17, 44, 0], 
        [17, 45, 0], 
        [17, 46, 0], 
        [17, 47, 0], 
        [17, 48, 0]
      ]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul337", 
      "inputs": [[14, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum3", 
      "attrs": {"axis": "1"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attrs": {"axis": "1"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like37", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater1", 
      "inputs": [[20, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like194", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "broadcast_maximum", 
      "name": "broadcast_maximum1", 
      "inputs": [[21, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div25", 
      "inputs": [[20, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like195", 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar73", 
      "attrs": {"scalar": "1484.6802122958004"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where325", 
      "inputs": [[23, 0, 0], [26, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar1", 
      "attrs": {"scalar": "1e-10"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1,)"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims11", 
      "attrs": {"axis": "1"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log25", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat56", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[9, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat59", 
      "attrs": {
        "axis": "0", 
        "repeats": "100"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "isPaddedTrain", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims8", 
      "attrs": {"axis": "2"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "isPaddedTrain_seq", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "49", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like61", 
      "inputs": [[12, 48, 0]]
    }, 
    {
      "op": "null", 
      "name": "timeFeaturesTrain", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "enc_input_seq", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "49", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like59", 
      "inputs": [[12, 47, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like57", 
      "inputs": [[12, 46, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like55", 
      "inputs": [[12, 45, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like53", 
      "inputs": [[12, 44, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like51", 
      "inputs": [[12, 43, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like49", 
      "inputs": [[12, 42, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like47", 
      "inputs": [[12, 41, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like45", 
      "inputs": [[12, 40, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like43", 
      "inputs": [[12, 39, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like41", 
      "inputs": [[12, 38, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like39", 
      "inputs": [[12, 37, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat57", 
      "attrs": {
        "dim": "1", 
        "num_args": "16"
      }, 
      "inputs": [
        [12, 36, 0], 
        [12, 35, 0], 
        [12, 34, 0], 
        [12, 33, 0], 
        [12, 32, 0], 
        [12, 31, 0], 
        [12, 30, 0], 
        [12, 26, 0], 
        [12, 25, 0], 
        [12, 24, 0], 
        [12, 14, 0], 
        [12, 13, 0], 
        [12, 12, 0], 
        [12, 2, 0], 
        [12, 1, 0], 
        [12, 0, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div26", 
      "inputs": [[53, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat58", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[41, 37, 0], [34, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t0_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_0begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where326", 
      "inputs": [[38, 37, 0], [59, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_0h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t0_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus144", 
      "inputs": [[58, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[65, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[65, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_0begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where327", 
      "inputs": [[38, 37, 0], [68, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul338", 
      "inputs": [[67, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[65, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul339", 
      "inputs": [[71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t0_state", 
      "inputs": [[70, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation120", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t0_out", 
      "inputs": [[66, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t0_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_1begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where328", 
      "inputs": [[38, 37, 0], [80, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_1h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t0_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus145", 
      "inputs": [[79, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[86, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[86, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_1begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where329", 
      "inputs": [[38, 37, 0], [89, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul340", 
      "inputs": [[88, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[86, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul341", 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t0_state", 
      "inputs": [[91, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation121", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t0_out", 
      "inputs": [[87, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t0_out_plus_residual", 
      "inputs": [[97, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_2i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_2i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_2t0_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_2begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where330", 
      "inputs": [[38, 37, 0], [102, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_2h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_2h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_2t0_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus146", 
      "inputs": [[101, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_2t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[108, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[108, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_2begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where331", 
      "inputs": [[38, 37, 0], [111, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul342", 
      "inputs": [[110, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[108, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul343", 
      "inputs": [[114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_2t0_state", 
      "inputs": [[113, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation122", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_2t0_out", 
      "inputs": [[109, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_2t0_out_plus_residual", 
      "inputs": [[119, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_3i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_3i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_3t0_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[120, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_3begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where332", 
      "inputs": [[38, 37, 0], [124, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l_3h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l_3h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_3t0_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus147", 
      "inputs": [[123, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_3t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[130, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[130, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l_3begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 94)"
      }, 
      "inputs": []
    }, 
    {
      "op": "where", 
      "name": "where333", 
      "inputs": [[38, 37, 0], [133, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul344", 
      "inputs": [[132, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[130, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul345", 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_3t0_state", 
      "inputs": [[135, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation123", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_3t0_out", 
      "inputs": [[131, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_3t0_out_plus_residual", 
      "inputs": [[141, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mu_Noneproj_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mu_Noneproj_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected48", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul349", 
      "inputs": [[145, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where342", 
      "inputs": [[38, 37, 0], [52, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where343", 
      "inputs": [[17, 37, 0], [12, 37, 0], [147, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat59", 
      "attrs": {
        "dim": "1", 
        "num_args": "16"
      }, 
      "inputs": [
        [148, 0, 0], 
        [12, 36, 0], 
        [12, 35, 0], 
        [12, 34, 0], 
        [12, 33, 0], 
        [12, 32, 0], 
        [12, 31, 0], 
        [12, 27, 0], 
        [12, 26, 0], 
        [12, 25, 0], 
        [12, 15, 0], 
        [12, 14, 0], 
        [12, 13, 0], 
        [12, 3, 0], 
        [12, 2, 0], 
        [12, 1, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div27", 
      "inputs": [[149, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat60", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[41, 38, 0], [34, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t1_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[151, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like196", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout192", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where334", 
      "inputs": [[154, 0, 0], [76, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where344", 
      "inputs": [[38, 38, 0], [59, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t1_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[156, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus150", 
      "inputs": [[152, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[159, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[159, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like197", 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout193", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where335", 
      "inputs": [[163, 0, 0], [74, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where345", 
      "inputs": [[38, 38, 0], [68, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul352", 
      "inputs": [[161, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[159, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul353", 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t1_state", 
      "inputs": [[166, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation125", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t1_out", 
      "inputs": [[160, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t1_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[172, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like198", 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout194", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where336", 
      "inputs": [[175, 0, 0], [97, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where346", 
      "inputs": [[38, 38, 0], [80, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t1_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[177, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus151", 
      "inputs": [[173, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[180, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[180, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like199", 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout195", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where337", 
      "inputs": [[184, 0, 0], [95, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where347", 
      "inputs": [[38, 38, 0], [89, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul354", 
      "inputs": [[182, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[180, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul355", 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t1_state", 
      "inputs": [[187, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation126", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t1_out", 
      "inputs": [[181, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t1_out_plus_residual", 
      "inputs": [[193, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_2t1_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[194, 0, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like200", 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout196", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where338", 
      "inputs": [[197, 0, 0], [119, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where348", 
      "inputs": [[38, 38, 0], [102, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_2t1_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[199, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus152", 
      "inputs": [[195, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_2t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[202, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[202, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like201", 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout197", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where339", 
      "inputs": [[206, 0, 0], [117, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where349", 
      "inputs": [[38, 38, 0], [111, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul356", 
      "inputs": [[204, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[202, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul357", 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_2t1_state", 
      "inputs": [[209, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation127", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_2t1_out", 
      "inputs": [[203, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_2t1_out_plus_residual", 
      "inputs": [[215, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_3t1_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[216, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like202", 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout198", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where340", 
      "inputs": [[219, 0, 0], [141, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where350", 
      "inputs": [[38, 38, 0], [124, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_3t1_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[221, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus153", 
      "inputs": [[217, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_3t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[224, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[224, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like203", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout199", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where341", 
      "inputs": [[228, 0, 0], [139, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where351", 
      "inputs": [[38, 38, 0], [133, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul358", 
      "inputs": [[226, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[224, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul359", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_3t1_state", 
      "inputs": [[231, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation128", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_3t1_out", 
      "inputs": [[225, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_3t1_out_plus_residual", 
      "inputs": [[237, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected50", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[238, 0, 0], [143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul363", 
      "inputs": [[239, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where360", 
      "inputs": [[38, 38, 0], [51, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where361", 
      "inputs": [[17, 38, 0], [12, 38, 0], [241, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat61", 
      "attrs": {
        "dim": "1", 
        "num_args": "16"
      }, 
      "inputs": [
        [242, 0, 0], 
        [148, 0, 0], 
        [12, 36, 0], 
        [12, 35, 0], 
        [12, 34, 0], 
        [12, 33, 0], 
        [12, 32, 0], 
        [12, 28, 0], 
        [12, 27, 0], 
        [12, 26, 0], 
        [12, 16, 0], 
        [12, 15, 0], 
        [12, 14, 0], 
        [12, 4, 0], 
        [12, 3, 0], 
        [12, 2, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div28", 
      "inputs": [[243, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat62", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[41, 39, 0], [34, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t2_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[245, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like204", 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout200", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where352", 
      "inputs": [[248, 0, 0], [172, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where362", 
      "inputs": [[38, 39, 0], [59, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t2_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[250, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus156", 
      "inputs": [[246, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[253, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[253, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like205", 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout201", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where353", 
      "inputs": [[257, 0, 0], [170, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where363", 
      "inputs": [[38, 39, 0], [68, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul366", 
      "inputs": [[255, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[253, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul367", 
      "inputs": [[261, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t2_state", 
      "inputs": [[260, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation130", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t2_out", 
      "inputs": [[254, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t2_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[266, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like206", 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout202", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where354", 
      "inputs": [[269, 0, 0], [193, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where364", 
      "inputs": [[38, 39, 0], [80, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t2_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[271, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus157", 
      "inputs": [[267, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_1t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[274, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[274, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like207", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout203", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where355", 
      "inputs": [[278, 0, 0], [191, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where365", 
      "inputs": [[38, 39, 0], [89, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul368", 
      "inputs": [[276, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_1t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[274, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul369", 
      "inputs": [[282, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t2_state", 
      "inputs": [[281, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation131", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_1t2_out", 
      "inputs": [[275, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_1t2_out_plus_residual", 
      "inputs": [[287, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_2t2_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[288, 0, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like208", 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout204", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where356", 
      "inputs": [[291, 0, 0], [215, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where366", 
      "inputs": [[38, 39, 0], [102, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_2t2_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[293, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus158", 
      "inputs": [[289, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_2t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[296, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[296, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like209", 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout205", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where357", 
      "inputs": [[300, 0, 0], [213, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where367", 
      "inputs": [[38, 39, 0], [111, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul370", 
      "inputs": [[298, 0, 0], [302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_2t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[296, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul371", 
      "inputs": [[304, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_2t2_state", 
      "inputs": [[303, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation132", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_2t2_out", 
      "inputs": [[297, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_2t2_out_plus_residual", 
      "inputs": [[309, 0, 0], [288, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_3t2_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[310, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like210", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout206", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where358", 
      "inputs": [[313, 0, 0], [237, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where368", 
      "inputs": [[38, 39, 0], [124, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_3t2_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[315, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus159", 
      "inputs": [[311, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_3t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[318, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[318, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like211", 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout207", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where359", 
      "inputs": [[322, 0, 0], [235, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where369", 
      "inputs": [[38, 39, 0], [133, 0, 0], [323, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul372", 
      "inputs": [[320, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_3t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[318, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul373", 
      "inputs": [[326, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_3t2_state", 
      "inputs": [[325, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation133", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_3t2_out", 
      "inputs": [[319, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_3t2_out_plus_residual", 
      "inputs": [[331, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected52", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[332, 0, 0], [143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul377", 
      "inputs": [[333, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where378", 
      "inputs": [[38, 39, 0], [50, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where379", 
      "inputs": [[17, 39, 0], [12, 39, 0], [335, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat63", 
      "attrs": {
        "dim": "1", 
        "num_args": "16"
      }, 
      "inputs": [
        [336, 0, 0], 
        [242, 0, 0], 
        [148, 0, 0], 
        [12, 36, 0], 
        [12, 35, 0], 
        [12, 34, 0], 
        [12, 33, 0], 
        [12, 29, 0], 
        [12, 28, 0], 
        [12, 27, 0], 
        [12, 17, 0], 
        [12, 16, 0], 
        [12, 15, 0], 
        [12, 5, 0], 
        [12, 4, 0], 
        [12, 3, 0]
      ]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div29", 
      "inputs": [[337, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat64", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[41, 40, 0], [34, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t3_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[339, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like212", 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout208", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[341, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where370", 
      "inputs": [[342, 0, 0], [266, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where380", 
      "inputs": [[38, 40, 0], [59, 0, 0], [343, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_0t3_h2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[344, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus162", 
      "inputs": [[340, 0, 0], [345, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l_0t3_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[347, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[347, 1, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like213", 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout209", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where371", 
      "inputs": [[351, 0, 0], [264, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where381", 
      "inputs": [[38, 40, 0], [68, 0, 0], [352, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul380", 
      "inputs": [[349, 0, 0], [353, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[347, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l_0t3_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[347, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul381", 
      "inputs": [[355, 0, 0], [356, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l_0t3_state", 
      "inputs": [[354, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation135", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[358, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l_0t3_out", 
      "inputs": [[348, 0, 0], [359, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l_1t3_i2h", 
      "attrs": {"num_hidden": "376"}, 
      "inputs": [[360, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like214", 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout210", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where372", 
      "inputs": [[363, 0, 0], [287, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where382", 
